z2care/ESP8266_EMOJI_SHOW/lib/lis3dh/lis3dh_reg.h
/**
  ******************************************************************************
  * @file    lis3dh_reg.h
  * @author  Sensors Software Solution Team
  * @brief   This file contains all the functions prototypes for the
  *          lis3dh_reg.c driver.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef LIS3DH_REGS_H
#define LIS3DH_REGS_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include <stdint.h>
#include <stddef.h>
#include <math.h>

/** @addtogroup LIS3DH
  * @{
  *
  */

/** @defgroup  Endianness definitions
  * @{
  *
  */

#ifndef DRV_BYTE_ORDER
#ifndef __BYTE_ORDER__

#define DRV_LITTLE_ENDIAN 1234
#define DRV_BIG_ENDIAN    4321

/** if _BYTE_ORDER is not defined, choose the endianness of your architecture
  * by uncommenting the define which fits your platform endianness
  */
//#define DRV_BYTE_ORDER    DRV_BIG_ENDIAN
#define DRV_BYTE_ORDER    DRV_LITTLE_ENDIAN

#else /* defined __BYTE_ORDER__ */

#define DRV_LITTLE_ENDIAN  __ORDER_LITTLE_ENDIAN__
#define DRV_BIG_ENDIAN     __ORDER_BIG_ENDIAN__
#define DRV_BYTE_ORDER     __BYTE_ORDER__

#endif /* __BYTE_ORDER__*/
#endif /* DRV_BYTE_ORDER */

/**
  * @}
  *
  */

/** @defgroup STMicroelectronics sensors common types
  * @{
  *
  */

#ifndef MEMS_SHARED_TYPES
#define MEMS_SHARED_TYPES

typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t bit0       : 1;
  uint8_t bit1       : 1;
  uint8_t bit2       : 1;
  uint8_t bit3       : 1;
  uint8_t bit4       : 1;
  uint8_t bit5       : 1;
  uint8_t bit6       : 1;
  uint8_t bit7       : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7       : 1;
  uint8_t bit6       : 1;
  uint8_t bit5       : 1;
  uint8_t bit4       : 1;
  uint8_t bit3       : 1;
  uint8_t bit2       : 1;
  uint8_t bit1       : 1;
  uint8_t bit0       : 1;
#endif /* DRV_BYTE_ORDER */
} bitwise_t;

#define PROPERTY_DISABLE                (0U)
#define PROPERTY_ENABLE                 (1U)

/** @addtogroup  Interfaces_Functions
  * @brief       This section provide a set of functions used to read and
  *              write a generic register of the device.
  *              MANDATORY: return 0 -> no Error.
  * @{
  *
  */

typedef int32_t (*stmdev_write_ptr)(void *, uint8_t, const uint8_t *, uint16_t);
typedef int32_t (*stmdev_read_ptr)(void *, uint8_t, uint8_t *, uint16_t);
typedef void (*stmdev_mdelay_ptr)(uint32_t millisec);

typedef struct
{
  /** Component mandatory fields **/
  stmdev_write_ptr  write_reg;
  stmdev_read_ptr   read_reg;
  /** Component optional fields **/
  stmdev_mdelay_ptr   mdelay;
  /** Customizable optional pointer **/
  void *handle;
} stmdev_ctx_t;

/**
  * @}
  *
  */

#endif /* MEMS_SHARED_TYPES */

#ifndef MEMS_UCF_SHARED_TYPES
#define MEMS_UCF_SHARED_TYPES

/** @defgroup    Generic address-data structure definition
  * @brief       This structure is useful to load a predefined configuration
  *              of a sensor.
  *              You can create a sensor configuration by your own or using
  *              Unico / Unicleo tools available on STMicroelectronics
  *              web site.
  *
  * @{
  *
  */

typedef struct
{
  uint8_t address;
  uint8_t data;
} ucf_line_t;

/**
  * @}
  *
  */

#endif /* MEMS_UCF_SHARED_TYPES */

/**
  * @}
  *
  */

/** @defgroup LIS3DH_Infos
  * @{
  *
  */

/** I2C Device Address 8 bit format if SA0=0 -> 31 if SA0=1 -> 33 **/
#define LIS3DH_I2C_ADD_L   0x31U
#define LIS3DH_I2C_ADD_H   0x33U

/** Device Identification (Who am I) **/
#define LIS3DH_ID          0x33U

/**
  * @}
  *
  */

#define LIS3DH_STATUS_REG_AUX        0x07U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t _1da              : 1;
  uint8_t _2da              : 1;
  uint8_t _3da              : 1;
  uint8_t _321da            : 1;
  uint8_t _1or              : 1;
  uint8_t _2or              : 1;
  uint8_t _3or              : 1;
  uint8_t _321or            : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t _321or            : 1;
  uint8_t _3or              : 1;
  uint8_t _2or              : 1;
  uint8_t _1or              : 1;
  uint8_t _321da            : 1;
  uint8_t _3da              : 1;
  uint8_t _2da              : 1;
  uint8_t _1da              : 1;
#endif /* DRV_BYTE_ORDER */
} lis3dh_status_reg_aux_t;

#define LIS3DH_OUT_ADC1_L            0x08U
#define LIS3DH_OUT_ADC1_H            0x09U
#define LIS3DH_OUT_ADC2_L            0x0AU
#define LIS3DH_OUT_ADC2_H            0x0BU
#define LIS3DH_OUT_ADC3_L            0x0CU
#define LIS3DH_OUT_ADC3_H            0x0DU
#define LIS3DH_WHO_AM_I              0x0FU

#define LIS3DH_CTRL_REG0             0x1EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used_01       : 7;
  uint8_t sdo_pu_disc       : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sdo_pu_disc       : 1;
  uint8_t not_used_01       : 7;
#endif /* DRV_BYTE_ORDER */
} lis3dh_ctrl_reg0_t;

#define LIS3DH_TEMP_CFG_REG          0x1FU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used_01       : 6;
  uint8_t temp_en           : 1;
  uint8_t adc_pd            : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t adc_pd            : 1;
  uint8_t temp_en           : 1;
  uint8_t not_used_01       : 6;
#endif /* DRV_BYTE_ORDER */
} lis3dh_temp_cfg_reg_t;

