z2care/ESP8266_EMOJI_SHOW/lib/lis3dh/lis3dh_reg.h
#define LIS3DH_INT1_THS             0x32U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ths               : 7;
  uint8_t not_used_01       : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01       : 1;
  uint8_t ths               : 7;
#endif /* DRV_BYTE_ORDER */
} lis3dh_int1_ths_t;

#define LIS3DH_INT1_DURATION        0x33U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t d                 : 7;
  uint8_t not_used_01       : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01       : 1;
  uint8_t d                 : 7;
#endif /* DRV_BYTE_ORDER */
} lis3dh_int1_duration_t;

#define LIS3DH_INT2_CFG             0x34U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xlie              : 1;
  uint8_t xhie              : 1;
  uint8_t ylie              : 1;
  uint8_t yhie              : 1;
  uint8_t zlie              : 1;
  uint8_t zhie              : 1;
  uint8_t _6d               : 1;
  uint8_t aoi               : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t aoi               : 1;
  uint8_t _6d               : 1;
  uint8_t zhie              : 1;
  uint8_t zlie              : 1;
  uint8_t yhie              : 1;
  uint8_t ylie              : 1;
  uint8_t xhie              : 1;
  uint8_t xlie              : 1;
#endif /* DRV_BYTE_ORDER */
} lis3dh_int2_cfg_t;

#define LIS3DH_INT2_SRC             0x35U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xl                : 1;
  uint8_t xh                : 1;
  uint8_t yl                : 1;
  uint8_t yh                : 1;
  uint8_t zl                : 1;
  uint8_t zh                : 1;
  uint8_t ia                : 1;
  uint8_t not_used_01       : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01       : 1;
  uint8_t ia                : 1;
  uint8_t zh                : 1;
  uint8_t zl                : 1;
  uint8_t yh                : 1;
  uint8_t yl                : 1;
  uint8_t xh                : 1;
  uint8_t xl                : 1;
#endif /* DRV_BYTE_ORDER */
} lis3dh_int2_src_t;

#define LIS3DH_INT2_THS             0x36U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ths               : 7;
  uint8_t not_used_01       : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01       : 1;
  uint8_t ths               : 7;
#endif /* DRV_BYTE_ORDER */
} lis3dh_int2_ths_t;

#define LIS3DH_INT2_DURATION        0x37U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t d                 : 7;
  uint8_t not_used_01       : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01       : 1;
  uint8_t d                 : 7;
#endif /* DRV_BYTE_ORDER */
} lis3dh_int2_duration_t;

#define LIS3DH_CLICK_CFG            0x38U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xs                : 1;
  uint8_t xd                : 1;
  uint8_t ys                : 1;
  uint8_t yd                : 1;
  uint8_t zs                : 1;
  uint8_t zd                : 1;
  uint8_t not_used_01       : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01       : 2;
  uint8_t zd                : 1;
  uint8_t zs                : 1;
  uint8_t yd                : 1;
  uint8_t ys                : 1;
  uint8_t xd                : 1;
  uint8_t xs                : 1;
#endif /* DRV_BYTE_ORDER */
} lis3dh_click_cfg_t;

#define LIS3DH_CLICK_SRC            0x39U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t x                 : 1;
  uint8_t y                 : 1;
  uint8_t z                 : 1;
  uint8_t sign              : 1;
  uint8_t sclick            : 1;
  uint8_t dclick            : 1;
  uint8_t ia                : 1;
  uint8_t not_used_01       : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01       : 1;
  uint8_t ia                : 1;
  uint8_t dclick            : 1;
  uint8_t sclick            : 1;
  uint8_t sign              : 1;
  uint8_t z                 : 1;
  uint8_t y                 : 1;
  uint8_t x                 : 1;
#endif /* DRV_BYTE_ORDER */
} lis3dh_click_src_t;

#define LIS3DH_CLICK_THS            0x3AU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ths               : 7;
  uint8_t lir_click         : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t lir_click         : 1;
  uint8_t ths               : 7;
#endif /* DRV_BYTE_ORDER */
} lis3dh_click_ths_t;

#define LIS3DH_TIME_LIMIT           0x3BU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t tli               : 7;
  uint8_t not_used_01       : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01       : 1;
  uint8_t tli               : 7;
#endif /* DRV_BYTE_ORDER */
} lis3dh_time_limit_t;

#define LIS3DH_TIME_LATENCY         0x3CU
typedef struct
{
  uint8_t tla               : 8;
} lis3dh_time_latency_t;

#define LIS3DH_TIME_WINDOW          0x3DU
typedef struct
{
  uint8_t tw                : 8;
} lis3dh_time_window_t;

#define LIS3DH_ACT_THS              0x3EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t acth              : 7;
  uint8_t not_used_01       : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01       : 1;
  uint8_t acth              : 7;
#endif /* DRV_BYTE_ORDER */
} lis3dh_act_ths_t;

#define LIS3DH_ACT_DUR              0x3FU
typedef struct
{
  uint8_t actd              : 8;
} lis3dh_act_dur_t;

/**
  * @defgroup LIS3DH_Register_Union
  * @brief    This union group all the registers having a bit-field
  *           description.
  *           This union is useful but it's not needed by the driver.
  *
  *           REMOVING this union you are compliant with:
  *           MISRA-C 2012 [Rule 19.2] -> " Union are not allowed "
  *
  * @{
  *
  */
typedef union
{
  lis3dh_status_reg_aux_t status_reg_aux;
  lis3dh_ctrl_reg0_t      ctrl_reg0;
  lis3dh_temp_cfg_reg_t   temp_cfg_reg;
  lis3dh_ctrl_reg1_t      ctrl_reg1;
  lis3dh_ctrl_reg2_t      ctrl_reg2;
  lis3dh_ctrl_reg3_t      ctrl_reg3;
  lis3dh_ctrl_reg4_t      ctrl_reg4;
  lis3dh_ctrl_reg5_t      ctrl_reg5;
  lis3dh_ctrl_reg6_t      ctrl_reg6;
  lis3dh_status_reg_t     status_reg;
  lis3dh_fifo_ctrl_reg_t  fifo_ctrl_reg;
  lis3dh_fifo_src_reg_t   fifo_src_reg;
  lis3dh_int1_cfg_t       int1_cfg;
  lis3dh_int1_src_t       int1_src;
  lis3dh_int1_ths_t       int1_ths;
  lis3dh_int1_duration_t  int1_duration;
  lis3dh_int2_cfg_t       int2_cfg;
  lis3dh_int2_src_t       int2_src;
  lis3dh_int2_ths_t       int2_ths;
  lis3dh_int2_duration_t  int2_duration;
  lis3dh_click_cfg_t      click_cfg;
  lis3dh_click_src_t      click_src;
  lis3dh_click_ths_t      click_ths;
  lis3dh_time_limit_t     time_limit;
  lis3dh_time_latency_t   time_latency;
  lis3dh_time_window_t    time_window;
  lis3dh_act_ths_t        act_ths;
  lis3dh_act_dur_t        act_dur;
  bitwise_t                 bitwise;
  uint8_t                   byte;
} lis3dh_reg_t;

/**
  * @}
  *
  */

#ifndef __weak
#define __weak __attribute__((weak))
#endif /* __weak */

