z2care/ESP8266_EMOJI_SHOW/lib/lis3dh/lis3dh_reg.h
/*
 * These are the basic platform dependent I/O routines to read
 * and write device registers connected on a standard bus.
 * The driver keeps offering a default implementation based on function
 * pointers to read/write routines for backward compatibility.
 * The __weak directive allows the final application to overwrite
 * them with a custom implementation.
 */

int32_t lis3dh_read_reg(const stmdev_ctx_t *ctx, uint8_t reg, uint8_t *data,
                        uint16_t len);
int32_t lis3dh_write_reg(const stmdev_ctx_t *ctx, uint8_t reg,
                         uint8_t *data,
                         uint16_t len);

float_t lis3dh_from_fs2_hr_to_mg(int16_t lsb);
float_t lis3dh_from_fs4_hr_to_mg(int16_t lsb);
float_t lis3dh_from_fs8_hr_to_mg(int16_t lsb);
float_t lis3dh_from_fs16_hr_to_mg(int16_t lsb);
float_t lis3dh_from_lsb_hr_to_celsius(int16_t lsb);

float_t lis3dh_from_fs2_nm_to_mg(int16_t lsb);
float_t lis3dh_from_fs4_nm_to_mg(int16_t lsb);
float_t lis3dh_from_fs8_nm_to_mg(int16_t lsb);
float_t lis3dh_from_fs16_nm_to_mg(int16_t lsb);
float_t lis3dh_from_lsb_nm_to_celsius(int16_t lsb);

float_t lis3dh_from_fs2_lp_to_mg(int16_t lsb);
float_t lis3dh_from_fs4_lp_to_mg(int16_t lsb);
float_t lis3dh_from_fs8_lp_to_mg(int16_t lsb);
float_t lis3dh_from_fs16_lp_to_mg(int16_t lsb);
float_t lis3dh_from_lsb_lp_to_celsius(int16_t lsb);

int32_t lis3dh_temp_status_reg_get(const stmdev_ctx_t *ctx, uint8_t *buff);
int32_t lis3dh_temp_data_ready_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis3dh_temp_data_ovr_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis3dh_temperature_raw_get(const stmdev_ctx_t *ctx, int16_t *val);

int32_t lis3dh_adc_raw_get(const stmdev_ctx_t *ctx, int16_t *buff);

typedef enum
{
  LIS3DH_AUX_DISABLE          = 0,
  LIS3DH_AUX_ON_TEMPERATURE   = 3,
  LIS3DH_AUX_ON_PADS          = 1,
} lis3dh_temp_en_t;
int32_t lis3dh_aux_adc_set(const stmdev_ctx_t *ctx, lis3dh_temp_en_t val);
int32_t lis3dh_aux_adc_get(const stmdev_ctx_t *ctx, lis3dh_temp_en_t *val);

typedef enum
{
  LIS3DH_HR_12bit   = 0,
  LIS3DH_NM_10bit   = 1,
  LIS3DH_LP_8bit    = 2,
} lis3dh_op_md_t;
int32_t lis3dh_operating_mode_set(const stmdev_ctx_t *ctx,
                                  lis3dh_op_md_t val);
int32_t lis3dh_operating_mode_get(const stmdev_ctx_t *ctx,
                                  lis3dh_op_md_t *val);

typedef enum
{
  LIS3DH_POWER_DOWN                      = 0x00,
  LIS3DH_ODR_1Hz                         = 0x01,
  LIS3DH_ODR_10Hz                        = 0x02,
  LIS3DH_ODR_25Hz                        = 0x03,
  LIS3DH_ODR_50Hz                        = 0x04,
  LIS3DH_ODR_100Hz                       = 0x05,
  LIS3DH_ODR_200Hz                       = 0x06,
  LIS3DH_ODR_400Hz                       = 0x07,
  LIS3DH_ODR_1kHz620_LP                  = 0x08,
  LIS3DH_ODR_5kHz376_LP_1kHz344_NM_HP    = 0x09,
} lis3dh_odr_t;
int32_t lis3dh_data_rate_set(const stmdev_ctx_t *ctx, lis3dh_odr_t val);
int32_t lis3dh_data_rate_get(const stmdev_ctx_t *ctx, lis3dh_odr_t *val);

int32_t lis3dh_high_pass_on_outputs_set(const stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t lis3dh_high_pass_on_outputs_get(const stmdev_ctx_t *ctx,
                                        uint8_t *val);

typedef enum
{
  LIS3DH_AGGRESSIVE  = 0,
  LIS3DH_STRONG      = 1,
  LIS3DH_MEDIUM      = 2,
  LIS3DH_LIGHT       = 3,
} lis3dh_hpcf_t;
int32_t lis3dh_high_pass_bandwidth_set(const stmdev_ctx_t *ctx,
                                       lis3dh_hpcf_t val);
int32_t lis3dh_high_pass_bandwidth_get(const stmdev_ctx_t *ctx,
                                       lis3dh_hpcf_t *val);

typedef enum
{
  LIS3DH_NORMAL_WITH_RST  = 0,
  LIS3DH_REFERENCE_MODE   = 1,
  LIS3DH_NORMAL           = 2,
  LIS3DH_AUTORST_ON_INT   = 3,
} lis3dh_hpm_t;
int32_t lis3dh_high_pass_mode_set(const stmdev_ctx_t *ctx,
                                  lis3dh_hpm_t val);
int32_t lis3dh_high_pass_mode_get(const stmdev_ctx_t *ctx,
                                  lis3dh_hpm_t *val);

typedef enum
{
  LIS3DH_2g   = 0,
  LIS3DH_4g   = 1,
  LIS3DH_8g   = 2,
  LIS3DH_16g  = 3,
} lis3dh_fs_t;
int32_t lis3dh_full_scale_set(const stmdev_ctx_t *ctx, lis3dh_fs_t val);
int32_t lis3dh_full_scale_get(const stmdev_ctx_t *ctx, lis3dh_fs_t *val);

int32_t lis3dh_block_data_update_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis3dh_block_data_update_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis3dh_filter_reference_set(const stmdev_ctx_t *ctx, uint8_t *buff);
int32_t lis3dh_filter_reference_get(const stmdev_ctx_t *ctx, uint8_t *buff);

int32_t lis3dh_xl_data_ready_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis3dh_xl_data_ovr_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis3dh_acceleration_raw_get(const stmdev_ctx_t *ctx, int16_t *val);

int32_t lis3dh_device_id_get(const stmdev_ctx_t *ctx, uint8_t *buff);

typedef enum
{
  LIS3DH_ST_DISABLE   = 0,
  LIS3DH_ST_POSITIVE  = 1,
  LIS3DH_ST_NEGATIVE  = 2,
} lis3dh_st_t;
int32_t lis3dh_self_test_set(const stmdev_ctx_t *ctx, lis3dh_st_t val);
int32_t lis3dh_self_test_get(const stmdev_ctx_t *ctx, lis3dh_st_t *val);

typedef enum
{
  LIS3DH_LSB_AT_LOW_ADD = 0,
  LIS3DH_MSB_AT_LOW_ADD = 1,
} lis3dh_ble_t;
int32_t lis3dh_data_format_set(const stmdev_ctx_t *ctx, lis3dh_ble_t val);
int32_t lis3dh_data_format_get(const stmdev_ctx_t *ctx, lis3dh_ble_t *val);

int32_t lis3dh_boot_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis3dh_boot_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis3dh_status_get(const stmdev_ctx_t *ctx,
                          lis3dh_status_reg_t *val);

int32_t lis3dh_int1_gen_conf_set(const stmdev_ctx_t *ctx,
                                 lis3dh_int1_cfg_t *val);
int32_t lis3dh_int1_gen_conf_get(const stmdev_ctx_t *ctx,
                                 lis3dh_int1_cfg_t *val);

int32_t lis3dh_int1_gen_source_get(const stmdev_ctx_t *ctx,
                                   lis3dh_int1_src_t *val);

