z2care/ESP8266_EMOJI_SHOW/lib/lis3dh/lis3dh_reg.h
int32_t lis3dh_int1_gen_threshold_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis3dh_int1_gen_threshold_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t lis3dh_int1_gen_duration_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis3dh_int1_gen_duration_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis3dh_int2_gen_conf_set(const stmdev_ctx_t *ctx,
                                 lis3dh_int2_cfg_t *val);
int32_t lis3dh_int2_gen_conf_get(const stmdev_ctx_t *ctx,
                                 lis3dh_int2_cfg_t *val);

int32_t lis3dh_int2_gen_source_get(const stmdev_ctx_t *ctx,
                                   lis3dh_int2_src_t *val);

int32_t lis3dh_int2_gen_threshold_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis3dh_int2_gen_threshold_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t lis3dh_int2_gen_duration_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis3dh_int2_gen_duration_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LIS3DH_DISC_FROM_INT_GENERATOR  = 0,
  LIS3DH_ON_INT1_GEN              = 1,
  LIS3DH_ON_INT2_GEN              = 2,
  LIS3DH_ON_TAP_GEN               = 4,
  LIS3DH_ON_INT1_INT2_GEN         = 3,
  LIS3DH_ON_INT1_TAP_GEN          = 5,
  LIS3DH_ON_INT2_TAP_GEN          = 6,
  LIS3DH_ON_INT1_INT2_TAP_GEN     = 7,
} lis3dh_hp_t;
int32_t lis3dh_high_pass_int_conf_set(const stmdev_ctx_t *ctx,
                                      lis3dh_hp_t val);
int32_t lis3dh_high_pass_int_conf_get(const stmdev_ctx_t *ctx,
                                      lis3dh_hp_t *val);

int32_t lis3dh_pin_int1_config_set(const stmdev_ctx_t *ctx,
                                   lis3dh_ctrl_reg3_t *val);
int32_t lis3dh_pin_int1_config_get(const stmdev_ctx_t *ctx,
                                   lis3dh_ctrl_reg3_t *val);

int32_t lis3dh_int2_pin_detect_4d_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis3dh_int2_pin_detect_4d_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

typedef enum
{
  LIS3DH_INT2_PULSED   = 0,
  LIS3DH_INT2_LATCHED  = 1,
} lis3dh_lir_int2_t;
int32_t lis3dh_int2_pin_notification_mode_set(const stmdev_ctx_t *ctx,
                                              lis3dh_lir_int2_t val);
int32_t lis3dh_int2_pin_notification_mode_get(const stmdev_ctx_t *ctx,
                                              lis3dh_lir_int2_t *val);

int32_t lis3dh_int1_pin_detect_4d_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis3dh_int1_pin_detect_4d_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

typedef enum
{
  LIS3DH_INT1_PULSED   = 0,
  LIS3DH_INT1_LATCHED  = 1,
} lis3dh_lir_int1_t;
int32_t lis3dh_int1_pin_notification_mode_set(const stmdev_ctx_t *ctx,
                                              lis3dh_lir_int1_t val);
int32_t lis3dh_int1_pin_notification_mode_get(const stmdev_ctx_t *ctx,
                                              lis3dh_lir_int1_t *val);

int32_t lis3dh_pin_int2_config_set(const stmdev_ctx_t *ctx,
                                   lis3dh_ctrl_reg6_t *val);
int32_t lis3dh_pin_int2_config_get(const stmdev_ctx_t *ctx,
                                   lis3dh_ctrl_reg6_t *val);

int32_t lis3dh_fifo_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis3dh_fifo_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis3dh_fifo_watermark_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis3dh_fifo_watermark_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LIS3DH_INT1_GEN = 0,
  LIS3DH_INT2_GEN = 1,
} lis3dh_tr_t;
int32_t lis3dh_fifo_trigger_event_set(const stmdev_ctx_t *ctx,
                                      lis3dh_tr_t val);
int32_t lis3dh_fifo_trigger_event_get(const stmdev_ctx_t *ctx,
                                      lis3dh_tr_t *val);

typedef enum
{
  LIS3DH_BYPASS_MODE           = 0,
  LIS3DH_FIFO_MODE             = 1,
  LIS3DH_DYNAMIC_STREAM_MODE   = 2,
  LIS3DH_STREAM_TO_FIFO_MODE   = 3,
} lis3dh_fm_t;
int32_t lis3dh_fifo_mode_set(const stmdev_ctx_t *ctx, lis3dh_fm_t val);
int32_t lis3dh_fifo_mode_get(const stmdev_ctx_t *ctx, lis3dh_fm_t *val);

int32_t lis3dh_fifo_status_get(const stmdev_ctx_t *ctx,
                               lis3dh_fifo_src_reg_t *val);

int32_t lis3dh_fifo_data_level_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis3dh_fifo_empty_flag_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis3dh_fifo_ovr_flag_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis3dh_fifo_fth_flag_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis3dh_tap_conf_set(const stmdev_ctx_t *ctx,
                            lis3dh_click_cfg_t *val);
int32_t lis3dh_tap_conf_get(const stmdev_ctx_t *ctx,
                            lis3dh_click_cfg_t *val);

int32_t lis3dh_tap_source_get(const stmdev_ctx_t *ctx,
                              lis3dh_click_src_t *val);

int32_t lis3dh_tap_threshold_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis3dh_tap_threshold_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LIS3DH_TAP_PULSED   = 0,
  LIS3DH_TAP_LATCHED  = 1,
} lis3dh_lir_click_t;
int32_t lis3dh_tap_notification_mode_set(const stmdev_ctx_t *ctx,
                                         lis3dh_lir_click_t val);
int32_t lis3dh_tap_notification_mode_get(const stmdev_ctx_t *ctx,
                                         lis3dh_lir_click_t *val);

int32_t lis3dh_shock_dur_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis3dh_shock_dur_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis3dh_quiet_dur_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis3dh_quiet_dur_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis3dh_double_tap_timeout_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis3dh_double_tap_timeout_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t lis3dh_act_threshold_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis3dh_act_threshold_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis3dh_act_timeout_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis3dh_act_timeout_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LIS3DH_PULL_UP_CONNECT     = 0,
  LIS3DH_PULL_UP_DISCONNECT  = 1,
} lis3dh_sdo_pu_disc_t;
int32_t lis3dh_pin_sdo_sa0_mode_set(const stmdev_ctx_t *ctx,
                                    lis3dh_sdo_pu_disc_t val);
int32_t lis3dh_pin_sdo_sa0_mode_get(const stmdev_ctx_t *ctx,
                                    lis3dh_sdo_pu_disc_t *val);

typedef enum
{
  LIS3DH_SPI_4_WIRE = 0,
  LIS3DH_SPI_3_WIRE = 1,
} lis3dh_sim_t;
int32_t lis3dh_spi_mode_set(const stmdev_ctx_t *ctx, lis3dh_sim_t val);
int32_t lis3dh_spi_mode_get(const stmdev_ctx_t *ctx, lis3dh_sim_t *val);

/**
  * @}
  *
  */

#ifdef __cplusplus
}
#endif

#endif /* LIS3DH_REGS_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/